package com.example.zfsoft.rxjavademo.module.bean;

import java.util.List;

/**
 * 创建日期：2018/7/11 on 10:21
 * 描述:
 * 作者:Ls
 */
public class TextNewsBean {

    /**
     * showapi_res_error :
     * showapi_res_code : 0
     * showapi_res_body : {"allPages":1785,"ret_code":0,"contentlist":[{"id":"5b483fec6e362f86412c494c","text":"姐姐和弟弟在聊天\u2026 \r\n姐姐: 你知道樱桃小丸子的姐姐叫什么吗？ \r\n弟弟: 樱桃大丸子？\r\n姐姐: 不对，是红烧狮子头\u2026 ","title":"姐姐和弟弟在聊天\u2026 ...","type":1,"ct":"2018-07-13 14:00:12.810"},{"id":"5b4831db6e362f86412c43b4","text":"和女友约会，突然，女友用手轻轻地揉着我的那个部位问：\u201c亲爱的，你这地方怎么鼓鼓的？\u201d<br />\r\n我一时没反应过来。她随即用另一只手摸着自己的相同部位说：\u201c我怎么不会啊？\u201d<br />\r\n我笑着说：\u201c那东西只有男人才有。\u201d<br />\r\n女友好奇地问：\u201c那是什么东西？\u201d<br />\r\n我淡定说：\u201c哦，你说这个呀\u2026\u2026喉结～\u201d","title":"内心毫无波动甚至还想笑","type":1,"ct":"2018-07-13 13:00:11.718"},{"id":"5b4831db6e362f86412c43b3","text":"现在上捧腹只要出现一张女人的图片，马上就会先看膝盖，再看中指，然后再搜寻旁边有没有什么黄瓜，茄子之类的，哎，我是怎么了。","title":"哎，我是怎么了","type":1,"ct":"2018-07-13 13:00:11.719"},{"id":"5b4831db6e362f86412c43b2","text":"\u201c女儿啊，早上看到你发了条新微博抱怨卡里没钱了，已给你转了。\u201d<br />\r\n\u201c谢谢妈妈，可是钱怎么还没到账呢？\u201d<br />\r\n\u201c什么到账？我是说已转发微博。\u201d","title":"已转","type":1,"ct":"2018-07-13 13:00:11.718"},{"id":"5b4831db6e362f86412c43b1","text":"我开车的时候最担心的不是路人乱穿马路，不是摩托车乱抢道，不是交警突然出现，而是车主突然出现。","title":"开车最担心的事","type":1,"ct":"2018-07-13 13:00:11.717"},{"id":"5b4831db6e362f86412c43b0","text":"算命的：\u201c你的婚姻线就如同天安门。\u201d<br />\r\n我：\u201c哦？很伟大吗？\u201d<br />\r\n算命的：\u201c往东是东单，往西是西单。\u201d","title":"孤孤单单","type":1,"ct":"2018-07-13 13:00:11.717"},{"id":"5b4831db6e362f86412c43af","text":"今天你们张老师没来，这节数学课由我来代一次。<br />\r\n下面，同学们把书翻到第22页，看第一题。<br />\r\n甲乙二人共拿10个苹果，甲比乙多拿4个，这位同学，你来答一下，这句话的主谓宾是什么？<br />\r\n语文老师你够了~~！！","title":"皮一下真的很快乐","type":1,"ct":"2018-07-13 13:00:11.717"},{"id":"5b4831db6e362f86412c43ae","text":"昨晚带新交的女友第一次去开房，结账时她一把拦住我，从包里利索地掏出酒店的贵宾卡付了帐。<br />\r\n我的心都凉了，没想到这个女人居然是情侣酒店的常客！出门后我一路闷闷不乐，终于忍不住了问她：\u201c刚才结完账，你为什么不要发票？\u201d","title":"没想到这个女人居然···","type":1,"ct":"2018-07-13 13:00:11.711"},{"id":"5b4831db6e362f86412c43ad","text":"我问我妈：\u201c我结婚了你准备问男方要多少彩礼钱？\u201d<br />\r\n我妈很坚定的说：\u201c不要了，养你这个祸害嫁到人家家里我就够愧疚了，人家肯把你弄走，搭钱都行！\u201d","title":"这大概就是亲妈吧","type":1,"ct":"2018-07-13 13:00:11.710"},{"id":"5b4831db6e362f86412c43ac","text":"问我妹：\u201c地球为什么会自转呢？\u201d<br />\r\n我以为她会说一大堆的哲理，没想到她说：\u201c估计几亿年前被扇了一耳光，又吃了炫迈。\u201d","title":"根本停不下来","type":1,"ct":"2018-07-13 13:00:11.709"},{"id":"5b4831db6e362f86412c43ab","text":"要知道，百分之八十的\u201c我想从背后抱紧你\u201d<br />\r\n是因为。。。。不想看到你的脸。","title":"这就是你喜欢关灯的原因？","type":1,"ct":"2018-07-13 13:00:11.708"},{"id":"5b48254f6e362f86412c4134","text":"\u201c女儿啊，早上看到你发了条新微博抱怨卡里没钱了，已给你转了。\u201d\r\n\u201c谢谢妈妈，可是钱怎么还没到账呢？\u201d\r\n\u201c什么到账？我是说已转发微博。\u201d","title":"\u201c女儿啊，早上看到你...","type":1,"ct":"2018-07-13 12:06:39.667"},{"id":"5b48254f6e362f86412c4133","text":"今天坐公交车上，不小心挤到一孕妇。\r\n刚想道歉，那姐们就先开口了：\u201c注意点，挤掉了你赔啊？\u201d\r\n我一看，长得挺漂亮，马上回答道：\u201c我赔，多大点事啊，真是的。\u201d\u200d\u200d\u200d\u200d","title":"今天坐公交车上，不小...","type":1,"ct":"2018-07-13 12:06:39.666"},{"id":"5b4815c16e362f86412c3a6f","text":"老婆怀孕，我陪在家没事喜欢玩几把LOL，老婆看不下去嫌我，说：\u201c你就玩吧，就当给你未来儿子胎教了，别人家孩子出生都是哭一嗓子，你家儿子牛逼，一出来就喊德玛西亚！\u201d","title":"老婆怀孕，我陪在家没...","type":1,"ct":"2018-07-13 11:00:17.738"},{"id":"5b4815c16e362f86412c3a6e","text":"算命的：\u201c你的婚姻线就如同天安门。\u201d\r\n我：\u201c哦？很伟大吗？\u201d\r\n算命的：\u201c往东是东单，往西是西单。\u201d","title":"算命的：\u201c你的婚姻线...","type":1,"ct":"2018-07-13 11:00:17.735"},{"id":"5b4815c16e362f86412c3a6d","text":"\u200d\u200d\u200d\u200d马上就要高考了，但是成绩总是上不去。\r\n于是我就跑到办公室问老师：\u201c学霸都是逼出来的吗？\u201d\r\n谁知旁边拖地的大爷来了一句：\u201c也有可能是剖腹产出来的。\u201d\u200d\u200d\u200d\u200d","title":"\u200d\u200d\u200d\u200d马上就要高考...","type":1,"ct":"2018-07-13 11:00:17.734"},{"id":"5b4815c16e362f86412c3a6b","text":"\u201c媳妇，过来陪我睡会儿！\u201d\u201c没空儿，看电视呢！你自己睡吧！\u201d\u201c媳妇，你知道当初有多少人想陪我睡觉，都被我无情的拒绝了不！\u201d\u201c为啥呢？\u201d\u201c因为她们要的价太TM高了！\u201d","title":"媳妇，过来陪我睡会儿","type":1,"ct":"2018-07-13 11:00:17.311"},{"id":"5b4815c16e362f86412c3a6a","text":"前几天吵架，我和老婆分被窝睡。今天早上起来老婆突然对我说：老公我想旅游。我问它想去哪，这货居然说：老公被窝一日游。。。","title":"前几天吵架，我和老婆分被窝睡。","type":1,"ct":"2018-07-13 11:00:17.310"},{"id":"5b4815c16e362f86412c3a69","text":"今天和老婆一起逛首饰店，老婆看中一款好几千的钻石戒指，我不想买，张嘴说了句：\u201c这戒指这么贵是加了什么属性吗？是加攻击还是加智力啊？\u201d营业员看了看我身边的老婆，说：\u201c加什么属性我不知道，反正今天你要不买，你老婆的愤怒值能加满，你信不？\u201d我。。。","title":"今天和老婆一起逛首饰店","type":1,"ct":"2018-07-13 11:00:17.310"},{"id":"5b4815c16e362f86412c3a68","text":"今天，我在家看报纸。听到媳妇和闺女因为作业的事，吵起来了。不大一会我媳妇就把女儿撵门外去了，女儿在门口喊：\u201c开门，送盒饭。\u201d媳妇：\u201c没叫。\u201d闺女：\u201c送快递。\u201d老婆：\u201c没买。\u201d闺女：\u201c交电费，查水表。\u201d老婆：\u201c都交过了。\u201d闺女：\u201c小丽，开门，我是你王哥。\u201d我在旁边笑，这娘俩，可真会玩啊。","title":"今天，我在家看报纸","type":1,"ct":"2018-07-13 11:00:17.310"}],"currentPage":1,"allNum":35687,"maxResult":20}
     */


        /**
         * allPages : 1785
         * ret_code : 0
         * contentlist : [{"id":"5b483fec6e362f86412c494c","text":"姐姐和弟弟在聊天\u2026 \r\n姐姐: 你知道樱桃小丸子的姐姐叫什么吗？ \r\n弟弟: 樱桃大丸子？\r\n姐姐: 不对，是红烧狮子头\u2026 ","title":"姐姐和弟弟在聊天\u2026 ...","type":1,"ct":"2018-07-13 14:00:12.810"},{"id":"5b4831db6e362f86412c43b4","text":"和女友约会，突然，女友用手轻轻地揉着我的那个部位问：\u201c亲爱的，你这地方怎么鼓鼓的？\u201d<br />\r\n我一时没反应过来。她随即用另一只手摸着自己的相同部位说：\u201c我怎么不会啊？\u201d<br />\r\n我笑着说：\u201c那东西只有男人才有。\u201d<br />\r\n女友好奇地问：\u201c那是什么东西？\u201d<br />\r\n我淡定说：\u201c哦，你说这个呀\u2026\u2026喉结～\u201d","title":"内心毫无波动甚至还想笑","type":1,"ct":"2018-07-13 13:00:11.718"},{"id":"5b4831db6e362f86412c43b3","text":"现在上捧腹只要出现一张女人的图片，马上就会先看膝盖，再看中指，然后再搜寻旁边有没有什么黄瓜，茄子之类的，哎，我是怎么了。","title":"哎，我是怎么了","type":1,"ct":"2018-07-13 13:00:11.719"},{"id":"5b4831db6e362f86412c43b2","text":"\u201c女儿啊，早上看到你发了条新微博抱怨卡里没钱了，已给你转了。\u201d<br />\r\n\u201c谢谢妈妈，可是钱怎么还没到账呢？\u201d<br />\r\n\u201c什么到账？我是说已转发微博。\u201d","title":"已转","type":1,"ct":"2018-07-13 13:00:11.718"},{"id":"5b4831db6e362f86412c43b1","text":"我开车的时候最担心的不是路人乱穿马路，不是摩托车乱抢道，不是交警突然出现，而是车主突然出现。","title":"开车最担心的事","type":1,"ct":"2018-07-13 13:00:11.717"},{"id":"5b4831db6e362f86412c43b0","text":"算命的：\u201c你的婚姻线就如同天安门。\u201d<br />\r\n我：\u201c哦？很伟大吗？\u201d<br />\r\n算命的：\u201c往东是东单，往西是西单。\u201d","title":"孤孤单单","type":1,"ct":"2018-07-13 13:00:11.717"},{"id":"5b4831db6e362f86412c43af","text":"今天你们张老师没来，这节数学课由我来代一次。<br />\r\n下面，同学们把书翻到第22页，看第一题。<br />\r\n甲乙二人共拿10个苹果，甲比乙多拿4个，这位同学，你来答一下，这句话的主谓宾是什么？<br />\r\n语文老师你够了~~！！","title":"皮一下真的很快乐","type":1,"ct":"2018-07-13 13:00:11.717"},{"id":"5b4831db6e362f86412c43ae","text":"昨晚带新交的女友第一次去开房，结账时她一把拦住我，从包里利索地掏出酒店的贵宾卡付了帐。<br />\r\n我的心都凉了，没想到这个女人居然是情侣酒店的常客！出门后我一路闷闷不乐，终于忍不住了问她：\u201c刚才结完账，你为什么不要发票？\u201d","title":"没想到这个女人居然···","type":1,"ct":"2018-07-13 13:00:11.711"},{"id":"5b4831db6e362f86412c43ad","text":"我问我妈：\u201c我结婚了你准备问男方要多少彩礼钱？\u201d<br />\r\n我妈很坚定的说：\u201c不要了，养你这个祸害嫁到人家家里我就够愧疚了，人家肯把你弄走，搭钱都行！\u201d","title":"这大概就是亲妈吧","type":1,"ct":"2018-07-13 13:00:11.710"},{"id":"5b4831db6e362f86412c43ac","text":"问我妹：\u201c地球为什么会自转呢？\u201d<br />\r\n我以为她会说一大堆的哲理，没想到她说：\u201c估计几亿年前被扇了一耳光，又吃了炫迈。\u201d","title":"根本停不下来","type":1,"ct":"2018-07-13 13:00:11.709"},{"id":"5b4831db6e362f86412c43ab","text":"要知道，百分之八十的\u201c我想从背后抱紧你\u201d<br />\r\n是因为。。。。不想看到你的脸。","title":"这就是你喜欢关灯的原因？","type":1,"ct":"2018-07-13 13:00:11.708"},{"id":"5b48254f6e362f86412c4134","text":"\u201c女儿啊，早上看到你发了条新微博抱怨卡里没钱了，已给你转了。\u201d\r\n\u201c谢谢妈妈，可是钱怎么还没到账呢？\u201d\r\n\u201c什么到账？我是说已转发微博。\u201d","title":"\u201c女儿啊，早上看到你...","type":1,"ct":"2018-07-13 12:06:39.667"},{"id":"5b48254f6e362f86412c4133","text":"今天坐公交车上，不小心挤到一孕妇。\r\n刚想道歉，那姐们就先开口了：\u201c注意点，挤掉了你赔啊？\u201d\r\n我一看，长得挺漂亮，马上回答道：\u201c我赔，多大点事啊，真是的。\u201d\u200d\u200d\u200d\u200d","title":"今天坐公交车上，不小...","type":1,"ct":"2018-07-13 12:06:39.666"},{"id":"5b4815c16e362f86412c3a6f","text":"老婆怀孕，我陪在家没事喜欢玩几把LOL，老婆看不下去嫌我，说：\u201c你就玩吧，就当给你未来儿子胎教了，别人家孩子出生都是哭一嗓子，你家儿子牛逼，一出来就喊德玛西亚！\u201d","title":"老婆怀孕，我陪在家没...","type":1,"ct":"2018-07-13 11:00:17.738"},{"id":"5b4815c16e362f86412c3a6e","text":"算命的：\u201c你的婚姻线就如同天安门。\u201d\r\n我：\u201c哦？很伟大吗？\u201d\r\n算命的：\u201c往东是东单，往西是西单。\u201d","title":"算命的：\u201c你的婚姻线...","type":1,"ct":"2018-07-13 11:00:17.735"},{"id":"5b4815c16e362f86412c3a6d","text":"\u200d\u200d\u200d\u200d马上就要高考了，但是成绩总是上不去。\r\n于是我就跑到办公室问老师：\u201c学霸都是逼出来的吗？\u201d\r\n谁知旁边拖地的大爷来了一句：\u201c也有可能是剖腹产出来的。\u201d\u200d\u200d\u200d\u200d","title":"\u200d\u200d\u200d\u200d马上就要高考...","type":1,"ct":"2018-07-13 11:00:17.734"},{"id":"5b4815c16e362f86412c3a6b","text":"\u201c媳妇，过来陪我睡会儿！\u201d\u201c没空儿，看电视呢！你自己睡吧！\u201d\u201c媳妇，你知道当初有多少人想陪我睡觉，都被我无情的拒绝了不！\u201d\u201c为啥呢？\u201d\u201c因为她们要的价太TM高了！\u201d","title":"媳妇，过来陪我睡会儿","type":1,"ct":"2018-07-13 11:00:17.311"},{"id":"5b4815c16e362f86412c3a6a","text":"前几天吵架，我和老婆分被窝睡。今天早上起来老婆突然对我说：老公我想旅游。我问它想去哪，这货居然说：老公被窝一日游。。。","title":"前几天吵架，我和老婆分被窝睡。","type":1,"ct":"2018-07-13 11:00:17.310"},{"id":"5b4815c16e362f86412c3a69","text":"今天和老婆一起逛首饰店，老婆看中一款好几千的钻石戒指，我不想买，张嘴说了句：\u201c这戒指这么贵是加了什么属性吗？是加攻击还是加智力啊？\u201d营业员看了看我身边的老婆，说：\u201c加什么属性我不知道，反正今天你要不买，你老婆的愤怒值能加满，你信不？\u201d我。。。","title":"今天和老婆一起逛首饰店","type":1,"ct":"2018-07-13 11:00:17.310"},{"id":"5b4815c16e362f86412c3a68","text":"今天，我在家看报纸。听到媳妇和闺女因为作业的事，吵起来了。不大一会我媳妇就把女儿撵门外去了，女儿在门口喊：\u201c开门，送盒饭。\u201d媳妇：\u201c没叫。\u201d闺女：\u201c送快递。\u201d老婆：\u201c没买。\u201d闺女：\u201c交电费，查水表。\u201d老婆：\u201c都交过了。\u201d闺女：\u201c小丽，开门，我是你王哥。\u201d我在旁边笑，这娘俩，可真会玩啊。","title":"今天，我在家看报纸","type":1,"ct":"2018-07-13 11:00:17.310"}]
         * currentPage : 1
         * allNum : 35687
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * id : 5b483fec6e362f86412c494c
             * text : 姐姐和弟弟在聊天…
             姐姐: 你知道樱桃小丸子的姐姐叫什么吗？
             弟弟: 樱桃大丸子？
             姐姐: 不对，是红烧狮子头…
             * title : 姐姐和弟弟在聊天… ...
             * type : 1
             * ct : 2018-07-13 14:00:12.810
             */

            private String id;
            private String text;
            private String title;
            private int type;
            private String ct;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
}
